[Killed] BlockStatement
index.js:2:37
 export const square = (x) => x * x
-export const capitalize = (text) => {
-    if (text === null) {
-      return undefined;
-    }
-    const firstChar = text[0].toUpperCase();
-    const restSubstring = text.slice(1);
-    return `${firstChar}${restSubstring}`;
-  };
+export const capitalize = (text) => {};
 export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
 
killedBy: task2 should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: undefined

[Killed] EqualityOperator
index.js:3:9
 export const square = (x) => x * x
 export const capitalize = (text) => {
-    if (text === null) {
+    if (text !== null) {
       return undefined;
     }
killedBy: task2 should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: undefined

[Killed] StringLiteral
index.js:8:12
     }
     const firstChar = text[0].toUpperCase();
     const restSubstring = text.slice(1);
-    return `${firstChar}${restSubstring}`;
+    return ``;
   };
 export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
killedBy: task2 should capitalize the string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: ""

[Killed] ConditionalExpression
index.js:10:59
     const restSubstring = text.slice(1);
     return `${firstChar}${restSubstring}`;
   };
-export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
+export const getChildren = (arr) => arr.filter((child) => false ).map((child) => child.name);
 
 
killedBy: task3 should work fine
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Alice",
- ]

[Killed] ArrowFunction
index.js:10:48
     const restSubstring = text.slice(1);
     return `${firstChar}${restSubstring}`;
   };
-export const getChildren = (arr) => arr.filter((child) => child.age < 17 ).map((child) => child.name);
+export const getChildren = (arr) => arr.filter(() => undefined ).map((child) => child.name);
 
 
killedBy: task3 should work fine
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Alice",
- ]
